InformationRegisters/Б24_СУ_ТаблицаИзменений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Б24_СУ_ТаблицаИзменений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяЗаписиВМиллисекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Б24_К_НастройкиПодключения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Б24_К_ТипыДанныхДляОбменаСПорталом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодчиненныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/Б24_СУ_РегистрацияИзмененийВызовСервера/Ext/Module.bsl
#Область ПодпискиНаСобытия

Процедура ПодпискаНаСобытиеРегистрПередЗаписью(Источник, Отказ, Замещение) Экспорт 

	Если Источник.ОбменДанными.Загрузка И Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.БазаИспользуетсяВМоделиСервиса() Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьИзменения(Источник, Замещение);

КонецПроцедуры

Процедура ПодпискаНаСобытиеСправочникДокументПриЗаписи(Источник, Отказ) Экспорт 

	Если Источник.ОбменДанными.Загрузка И Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.БазаИспользуетсяВМоделиСервиса() Тогда
		Возврат;
	КонецЕсли;

	ЗарегистрироватьИзменения(Источник);

КонецПроцедуры

#КонецОбласти
  
  
#Область РегистрацияИзменений

Процедура ЗарегистрироватьИзменения(Источник, Замещение = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипОбъекта = ТипЗнч(Источник);
	
#Область ДобавлениеИнформацииДляИсключенияРегистрации      
	ЗагрузкаСБитрикс24 = Неопределено;
	Источник.ДополнительныеСвойства.Свойство("ЗагрузкаСБитрикс24", ЗагрузкаСБитрикс24);
	
	Если ЗагрузкаСБитрикс24 = Истина ИЛИ ПараметрыСеанса.ВыполняетсяОбновлениеИБ Тогда
		Возврат;
	КонецЕсли;
#КонецОбласти	

	ТипыДанныхДляОбменаСПорталом = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьТипыДанныхДляОбменаСПорталом();

	МассивНастроекОВыгружаемыхДанных = Б24_СУ_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьМассивНастроекОВыгружаемыхДанных();
	Для каждого ИнформацияОНастройке Из МассивНастроекОВыгружаемыхДанных Цикл
		
		НастройкаПодключения = ИнформацияОНастройке.НастройкаПодключения;
		
	//	Если ТипОбъекта =  Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда 
	//		
	//		Если НЕ ИнформацияОНастройке.ВыгружатьОтгрузки Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		РегистрыСведений.Б24_СУ_ТаблицаИзменений.ДобавитьОбъектВТаблицуИзменений(НастройкаПодключения, ТипыДанныхДляОбменаСПорталом.Отгрузка, Неопределено, Источник.Ссылка);	
	//		
	//	ИначеЕсли ТипОбъекта =  Тип("СправочникОбъект.НоменклатураПрисоединенныеФайлы") Тогда 
	//		
	//		Если НЕ ИнформацияОНастройке.ВыгружатьКартинки Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		РегистрыСведений.Б24_СУ_ТаблицаИзменений.ДобавитьОбъектВТаблицуИзменений(НастройкаПодключения, ТипыДанныхДляОбменаСПорталом.КартинкаФайлТовара2, Неопределено, Источник.Ссылка);	
	//		
	//	ИначеЕсли ТипОбъекта =  Тип("РегистрСведенийНаборЗаписей.ЦеныНоменклатуры") Тогда 
	//		
	//		Если НЕ ИнформацияОНастройке.ВыгружатьЦены Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		Прайсы = ИнформацияОНастройке.Прайсы;
	//		
	//		УжеДобавлены = Новый Массив;
	//		
	//		ПакетДанных = ПакетДанныхДляРегистрацииИзменений();
	//		
	//		Если Замещение Тогда
	//			
	//			СтарыйНаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
	//			
	//			Для Каждого ЗначениеОтбора Из Источник.Отбор Цикл
	//				
	//				Если ЗначениеОтбора.Использование = Ложь Тогда
	//					Продолжить;
	//				КонецЕсли;
	//				
	//				СтрокаОтбора = СтарыйНаборЗаписей.Отбор.Найти(ЗначениеОтбора.Имя);
	//				СтрокаОтбора.Значение = ЗначениеОтбора.Значение;
	//				СтрокаОтбора.Использование = Истина;
	//				
	//			КонецЦикла;
	//			
	//			СтарыйНаборЗаписей.Прочитать();
	//			
	//			Для каждого ТекЗапись Из СтарыйНаборЗаписей Цикл
	//				
	//				Если Прайсы.Найти(ТекЗапись.ВидЦены) <> Неопределено Тогда    
	//					
	//					УИДЗаписи = XMLСтрока(ТекЗапись.Номенклатура) +"_"+ XMLСтрока(ТекЗапись.Характеристика);   
	//					Если УжеДобавлены.Найти(УИДЗаписи) = Неопределено Тогда
	//						
	//						УжеДобавлены.Добавить(УИДЗаписи);	
	//						
	//						ДобавитьЗапистьВПакетДанныхДляРегистрации(ПакетДанных, НастройкаПодключения, ТипыДанныхДляОбменаСПорталом.Цена, Справочники.ВидыЦен.ПустаяСсылка()
	//							, ТекЗапись.Номенклатура, ТекЗапись.Характеристика);
	//						
	//					КонецЕсли;
	//					
	//				КонецЕсли;
	//				
	//			КонецЦикла;
	//			
	//		КонецЕсли;

	//		Для Каждого ТекЗапись Из Источник Цикл
	//			
	//			Если Прайсы.Найти(ТекЗапись.ВидЦены) <> Неопределено Тогда     
	//				
	//				УИДЗаписи = XMLСтрока(ТекЗапись.Номенклатура) +"_"+ XMLСтрока(ТекЗапись.Характеристика);   
	//				Если УжеДобавлены.Найти(УИДЗаписи) = Неопределено Тогда
	//						
	//					УжеДобавлены.Добавить(УИДЗаписи);	
	//				
	//					ДобавитьЗапистьВПакетДанныхДляРегистрации(ПакетДанных, НастройкаПодключения, ТипыДанныхДляОбменаСПорталом.Цена, Справочники.ВидыЦен.ПустаяСсылка()
	//						, ТекЗапись.Номенклатура, ТекЗапись.Характеристика);
	//				
	//				КонецЕсли;
	//				
	//			КонецЕсли;
	//			
	//		КонецЦикла; 
	//		
	//		ЗарегистрироватьПакетОбъектов(ПакетДанных);
	//		
	//	ИначеЕсли ТипОбъекта =  Тип("РегистрСведенийНаборЗаписей.ЦеныНоменклатуры25") Тогда 
	//		
	//		Если НЕ ИнформацияОНастройке.ВыгружатьЦены Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		Прайсы = ИнформацияОНастройке.Прайсы;
	//		
	//		УжеДобавлены = Новый Массив;
	//		
	//		ПакетДанных = ПакетДанныхДляРегистрацииИзменений();
	//		
	//		Если Замещение Тогда
	//			
	//			СтарыйНаборЗаписей = РегистрыСведений.ЦеныНоменклатуры25.СоздатьНаборЗаписей();
	//			
	//			Для Каждого ЗначениеОтбора Из Источник.Отбор Цикл
	//				
	//				Если ЗначениеОтбора.Использование = Ложь Тогда
	//					Продолжить;
	//				КонецЕсли;
	//				
	//				СтрокаОтбора = СтарыйНаборЗаписей.Отбор.Найти(ЗначениеОтбора.Имя);
	//				СтрокаОтбора.Значение = ЗначениеОтбора.Значение;
	//				СтрокаОтбора.Использование = Истина;
	//				
	//			КонецЦикла;
	//			
	//			СтарыйНаборЗаписей.Прочитать();
	//			
	//			Запрос = Новый Запрос;
	//			Запрос.УстановитьПараметр("НаборЗаписей", СтарыйНаборЗаписей.Выгрузить(,"Номенклатура, ХарактеристикаЦО, ВидЦены"));
	//			Запрос.Текст = "ВЫБРАТЬ
	//			|	НаборЗаписей.Номенклатура КАК Номенклатура,
	//			|	НаборЗаписей.ХарактеристикаЦО КАК ХарактеристикаЦО,
	//			|	НаборЗаписей.ВидЦены КАК ВидЦены
	//			|ПОМЕСТИТЬ ВТ_Данные
	//			|ИЗ
	//			|	&НаборЗаписей КАК НаборЗаписей
	//			|;
	//			|
	//			|////////////////////////////////////////////////////////////////////////////////
	//			|ВЫБРАТЬ     
	//			|	ВТ_Данные.ВидЦены КАК ВидЦены,
	//			|	ВТ_Данные.Номенклатура КАК Номенклатура,
	//			|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
	//			|ИЗ
	//			|	ВТ_Данные КАК ВТ_Данные
	//			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	//			|		ПО ВТ_Данные.ХарактеристикаЦО = ХарактеристикиНоменклатуры.ХарактеристикаНоменклатурыДляЦенообразования";
	//			
	//			ВыполненныйЗапрос = Запрос.Выполнить();
	//			Если НЕ ВыполненныйЗапрос.Пустой() Тогда
	//				Выборка = ВыполненныйЗапрос.Выбрать();
	//				Пока Выборка.Следующий() Цикл
	//				
	//					Если Прайсы.Найти(Выборка.ВидЦены) <> Неопределено Тогда    
	//						
	//						УИДЗаписи = XMLСтрока(Выборка.Номенклатура) +"_"+ XMLСтрока(Выборка.Характеристика);   
	//						Если УжеДобавлены.Найти(УИДЗаписи) = Неопределено Тогда
	//							
	//							УжеДобавлены.Добавить(УИДЗаписи);	
	//							
	//							ДобавитьЗапистьВПакетДанныхДляРегистрации(ПакетДанных, НастройкаПодключения, ТипыДанныхДляОбменаСПорталом.Цена, Справочники.ВидыЦен.ПустаяСсылка()
	//								, Выборка.Номенклатура, Выборка.Характеристика);
	//							
	//						КонецЕсли;
	//						
	//					КонецЕсли;
	//					
	//				КонецЦикла;
	//			
	//			КонецЕсли;
	//		КонецЕсли;
	//		
	//		Запрос = Новый Запрос;
	//		Запрос.УстановитьПараметр("НаборЗаписей", Источник.Выгрузить(,"Номенклатура, ХарактеристикаЦО, ВидЦены"));
	//		Запрос.Текст = "ВЫБРАТЬ
	//		|	НаборЗаписей.Номенклатура КАК Номенклатура,
	//		|	НаборЗаписей.ХарактеристикаЦО КАК ХарактеристикаЦО,
	//		|	НаборЗаписей.ВидЦены КАК ВидЦены
	//		|ПОМЕСТИТЬ ВТ_Данные
	//		|ИЗ
	//		|	&НаборЗаписей КАК НаборЗаписей
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ     
	//		|	ВТ_Данные.ВидЦены КАК ВидЦены,
	//		|	ВТ_Данные.Номенклатура КАК Номенклатура,
	//		|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика
	//		|ИЗ
	//		|	ВТ_Данные КАК ВТ_Данные
	//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	//		|		ПО ВТ_Данные.ХарактеристикаЦО = ХарактеристикиНоменклатуры.ХарактеристикаНоменклатурыДляЦенообразования";
	//		
	//		ВыполненныйЗапрос = Запрос.Выполнить();
	//		Если НЕ ВыполненныйЗапрос.Пустой() Тогда
	//			Выборка = ВыполненныйЗапрос.Выбрать();
	//			Пока Выборка.Следующий() Цикл
	//			
	//				Если Прайсы.Найти(Выборка.ВидЦены) <> Неопределено Тогда     
	//					
	//					УИДЗаписи = XMLСтрока(Выборка.Номенклатура) +"_"+ XMLСтрока(Выборка.Характеристика);   
	//					Если УжеДобавлены.Найти(УИДЗаписи) = Неопределено Тогда
	//							
	//						УжеДобавлены.Добавить(УИДЗаписи);	
	//					
	//						ДобавитьЗапистьВПакетДанныхДляРегистрации(ПакетДанных, НастройкаПодключения, ТипыДанныхДляОбменаСПорталом.Цена, Справочники.ВидыЦен.ПустаяСсылка()
	//							, Выборка.Номенклатура, Выборка.Характеристика);
	//					
	//					КонецЕсли;
	//					
	//				КонецЕсли;
	//				
	//			КонецЦикла;  
	//			
	//		КонецЕсли;  
	//		
	//		ЗарегистрироватьПакетОбъектов(ПакетДанных);
	//		
	//	ИначеЕсли ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.РаспределениеЗапасов") Тогда 
	//		
	//		Если НЕ ИнформацияОНастройке.ВыгружатьОстатки Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//  		Склады = ИнформацияОНастройке.Склады;
	//		
	//		УжеДобавлены = Новый Массив;
	//		
	//		ПакетДанных = ПакетДанныхДляРегистрацииИзменений();
	//		
	//		Если Замещение Тогда
	//			
	//			СтарыйНаборЗаписей = РегистрыСведений.РаспределениеЗапасов.СоздатьНаборЗаписей();
	//			
	//			Для Каждого ЗначениеОтбора Из Источник.Отбор Цикл
	//				
	//				Если ЗначениеОтбора.Использование = Ложь Тогда
	//					Продолжить;
	//				КонецЕсли;
	//				
	//				СтрокаОтбора = СтарыйНаборЗаписей.Отбор.Найти(ЗначениеОтбора.Имя);
	//				СтрокаОтбора.Значение = ЗначениеОтбора.Значение;
	//				СтрокаОтбора.Использование = Истина;
	//				
	//			КонецЦикла;
	//			
	//			СтарыйНаборЗаписей.Прочитать();
	//			
	//			Для каждого ТекЗапись Из СтарыйНаборЗаписей Цикл
	//				
	//				Если Склады.Найти(ТекЗапись.Склад) <> Неопределено Тогда     
	//				
	//					УИДЗаписи = XMLСтрока(ТекЗапись.Склад) +"_"+ XMLСтрока(ТекЗапись.Номенклатура) +"_"+ XMLСтрока(ТекЗапись.Характеристика);   
	//					Если УжеДобавлены.Найти(УИДЗаписи) = Неопределено Тогда
	//						
	//						УжеДобавлены.Добавить(УИДЗаписи);	
	//					
	//						ДобавитьЗапистьВПакетДанныхДляРегистрации(ПакетДанных, НастройкаПодключения, ТипыДанныхДляОбменаСПорталом.Остаток, ТекЗапись.Склад
	//							, ТекЗапись.Номенклатура, ТекЗапись.Характеристика);
	//				
	//					КонецЕсли; 
	//					
	//				КонецЕсли;
	//				
	//			КонецЦикла;
	//			
	//		КонецЕсли;
	//		
	//		Для Каждого ТекЗапись Из Источник Цикл
	//			
	//			Если Склады.Найти(ТекЗапись.Склад) <> Неопределено Тогда   
	//				
	//				УИДЗаписи = XMLСтрока(ТекЗапись.Склад) +"_"+ XMLСтрока(ТекЗапись.Номенклатура) +"_"+ XMLСтрока(ТекЗапись.Характеристика);   
	//				Если УжеДобавлены.Найти(УИДЗаписи) = Неопределено  Тогда
	//						
	//					УжеДобавлены.Добавить(УИДЗаписи);	
	//				
	//					ДобавитьЗапистьВПакетДанныхДляРегистрации(ПакетДанных, НастройкаПодключения, ТипыДанныхДляОбменаСПорталом.Остаток, ТекЗапись.Склад
	//						, ТекЗапись.Номенклатура, ТекЗапись.Характеристика);
	//					
	//				КонецЕсли;
	//				
	//			КонецЕсли;
	//				
	//		КонецЦикла;    
	//		
	//		ЗарегистрироватьПакетОбъектов(ПакетДанных);
	//		
	//	КонецЕсли;
	КонецЦикла;
	
	Для Каждого ИнформацияОНастройке Из МассивНастроекОВыгружаемыхДанных Цикл
		Б24_СУ_ОбщегоНазначенияВызовСервера.ВыгрузкаВРеальномВремени(ИнформацияОНастройке);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Функция ПакетДанныхДляРегистрацииИзменений()
	
	ПакетДанных = Новый ТаблицаЗначений;
	ПакетДанных.Колонки.Добавить("НастройкаПодключения", Новый ОписаниеТипов("СправочникСсылка.Б24_К_НастройкиПодключения"));
	ПакетДанных.Колонки.Добавить("ТипОбъекта");
	ПакетДанных.Колонки.Добавить("Ключ");
	ПакетДанных.Колонки.Добавить("Объект");
	ПакетДанных.Колонки.Добавить("ПодчиненныйОбъект", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));

	Возврат ПакетДанных;
	
КонецФункции

Процедура ДобавитьЗапистьВПакетДанныхДляРегистрации(ПакетДанных, НастройкаПодключения, ТипОбъекта, Ключ, Объект, ПодчиненныйОбъект = Неопределено)
	
	НоваяСтрока = ПакетДанных.Добавить();
	НоваяСтрока.НастройкаПодключения 	= НастройкаПодключения;
	НоваяСтрока.Ключ 					= Ключ;
	НоваяСтрока.Объект 					= Объект;
	НоваяСтрока.ПодчиненныйОбъект 		= ПодчиненныйОбъект;
	НоваяСтрока.ТипОбъекта 				= ТипОбъекта;

КонецПроцедуры

Процедура ЗарегистрироватьПакетОбъектов(ПакетДанных)
	
	Для каждого ТекСтрока Из ПакетДанных Цикл
		
		РегистрыСведений.Б24_СУ_ТаблицаИзменений.ДобавитьОбъектВТаблицуИзменений(ТекСтрока.НастройкаПодключения, ТекСтрока.ТипОбъекта, ТекСтрока.Ключ 
			, ТекСтрока.Объект, ТекСтрока.ПодчиненныйОбъект);	
	
	КонецЦикла;
	
КонецПроцедуры  

#КонецОбласти
